#include<stdio.h>
#include<math.h>
int main ()
{
    float i,p,a,b,c,d,e;//定义字符类型
printf("请输入当月利润(单位为￥):\n");//请用户输入当月利润
scanf("%f",&i);
    a=100000*0.1;//定义a,b,c,d,e变量的初值
    b=a+100000*0.075;
    c=b+200000*0.05;
    d=c+200000*0.03;
    e=d+400000*0.015;
    if(i<=100000)//判断i的大小，如果i满足以下各条件，对应运行各个语句
        p=i*0.1;
else if(i>100000&&i<=200000)
        p=a+(i-100000)*0.075;
else if(i>200000&&i<=400000)
    p=b+(i-200000)*0.05;
else if(i>400000&&i<=600000)
    p=c+(i-400000)*0.03;
else if(i>600000&&i<=1000000)
    p=d+(i-600000)*0.015;
else
    p=e+(i-1000000)*0.01;
printf("当月所获奖金额为:%.2f￥\n",p);//输出当月所获金额
return 0;
}
